{
  "greeting": "Hello, my name is",
  "title": "Marcus Gabilheri",
  "subtitle": "I am a college student who specializes in mobile apps development.",
  "banner_url": "assets/images/profile_big_resized.jpg",
  "projects": [
    {
      "name": "fit•hub",
      "thumb": "./assets/fithub/fithub_web.png",
      "url": "fithub",
      "desc": "One of the Grand Prize winners of the Google Fit Developers Challenge!! Fitness app that aggregates multiple trackers for competing with friends."
    },
    {
      "name": "Canopeo",
      "thumb": "./assets/canopeo/canopeo_logo.png",
      "url": "",
      "desc": "App for farmers and soil researchers to quantify the amount of green canopy on a specific part of a field."
    },
    {
      "name": "Inbox Dashclock Extension",
      "thumb": "./assets/inbox_dashclock/icon.webp",
      "url": "",
      "desc": "Inbox extension for the popular DashClock widget by Roman Nurik. Allows to see number of emails in your inbox broken down by groups on the widget."
    },
    {
      "name": "Paws Alert",
      "thumb": "./assets/paws/icon.png",
      "url": "",
      "desc": "Winning submission for the Oklahoma State App Contest in Spring 2016. Uses geofences to alert users of pets reported lost nearby."
    }
  ],
  "skills": [
    {
      "name": "Skills",
      "items": [
        {
          "name": "Android",
          "icon": "./assets/icons/android.png",
          "description": "I have created professional Android apps using common open source libraries, including Dagger 2 and Retrofit."
        },
        {
          "name": "iOS",
          "icon": "./assets/icons/apple.png",
          "description": "I have developed iOS apps in Swift with standard open source libraries like Alamofire and Realm."
        },
        {
          "name": "UI/UX Design",
          "icon": "./assets/icons/ux_design.png",
          "description": "I understand the principles of Mobile UX design and have created beautiful applications using Material Design guidelines."
        },
        {
          "name": "Node JS",
          "icon": "./assets/icons/node.png",
          "description": "I have created a server for a medium size application using NodeJS, Express and Mongo DB."
        },
        {
          "name": "Angular JS",
          "icon": "./assets/icons/angular.png",
          "description": "I have created Web Applications and Websites using Angular JS. This website was developed using Angular."
        },
        {
          "name": "Java",
          "icon": "./assets/icons/java.png",
          "description": "I have used Java to develop mobile, desktop and server side applications."
        },
        {
          "name": "Github",
          "icon": "./assets/icons/github.png",
          "description": "I have used Git Version Control to manage many of my projects. Most applications I have created can be found on my Github profile."
        },
        {
          "name": "Python / Django",
          "icon": "./assets/icons/django.png",
          "description": "I have Created a web server for an application using Django. Application features included managing a database, analyzing and processing data, and manipulation and storage of images."
        }
      ]
    }
  ],
  "about": {
    "pic": "",
    "description": [
      "I am a Computer Science Student at Oklahoma State University living in Stillwater, Oklahoma. I am currently working as a Full Stack developer for the Plants & Soil Sciences Department at Oklahoma State University.",
      "During my college career I have participated and won 1st place in the Oklahoma State University App Contest 3 years in a row",
      "I'm also the founder and organizer of the Google Developers Group OSU Stillwater (GDG OSU) chapter. GDG activies involve planning and running events to expose students to a variety of topics. During the previous 3 years I have taught and coached many students on how to build their 1st Android application and developed a variety of tutorials that can be found on my github page.",
      "When I'm not in class or working I really enjoy developing mobile apps, playing with my pets, hanging out with my wife and cooking."
    ]
  }
}
