{
  "name": "fit•hub",
  "thumb": "./assets/fithub/fithub_web.png",
  "banner": "./assets/fithub/banner.jpg",
  "url": "fithub",
  "short": "One of the Grand Prize winners of the Google Fit Developers Challenge!! Fitness app that aggregates multiple trackers for competing with friends.",
  "description": [
    "fit•hub was one of the Grand Prize winners of the Google Fit Developers Challenge!!",
    "Syncs multiple accounts into one single dataset or allows user to view them individually. fit•hub can only reads data from the official apps and can not be used in substitution of them.",
    "Allows users with different fitness trackers to compete among themselves."
  ],
  "technologies": [
    {
      "icon": "./assets/icons/android.png",
      "name": "Android",
      "usage": [
        "This app was first developed as a Android app only for the Google fit Contest.",
        "The current Android implementation is developed using modern Android principles for efficient data usage.",
        "The app uses Dagger 2 for dependency injection, RXJava, OkHttp3 and Retrofit2 for it's data retrieval. The local cache uses SQLite among SQLBrite to be able to perform reactive queries."
      ]
    },
    {
      "icon": "./assets/icons/node.png",
      "name": "Node JS",
      "usage": [
        "The server stack is completely developed in NodeJS with Mongo DB.",
        "Tasks done by the server include sync of user fitness data and push to the phone as well as taken care of notifying storing the data on the Mongo DB.",
        "Data analysis is also done by the NodeJS to find trends on fitness usage to be used on future features of the app.",
        "All the charts in the app where made using MPAndroidChart with a modified Data Renderer to allow more interesting charts.",
        "The app also makes usage of Google API's to retrieve Google Fit data, Sign In and Firebase message."
      ]
    },
    {
      "icon": "./assets/icons/apple.png",
      "name": "iOS / Swift",
      "usage": [
        "Currently under development. The release date is estimated to be mid November.",
        "The iOS app is completely developed in Swift 3.",
        "The app uses the Material framework by CosmicMind for the UI Layer.",
        "For the application layer the app uses Alamofire for the network request and Realm for the data cache persistence layer."
      ]
    }
  ],
  "screenshots": [
    "./assets/fithub/Dashboard_bar.png",
    "./assets/fithub/Dashboard_line.png",
    "./assets/fithub/Today.png",
    "./assets/fithub/leaderboard.png",
    "./assets/fithub/sign_in.png",
    "./assets/fithub/my_account.png",
    "./assets/fithub/drawer_open.png",
    "./assets/fithub/device.png",
    "./assets/fithub/intro.png",
    "./assets/fithub/enable_location.png",
    "./assets/fithub/enable_notifications.png",
    "./assets/fithub/settings.png",
    "./assets/fithub/head_head.png",
    "./assets/fithub/first_syncing.png"
  ]
}